import json

from django.contrib.auth import authenticate
from django.core.exceptions import PermissionDenied
from django.http import HttpResponse
from django.views.decorators.csrf import csrf_exempt

from two_side_app.models import Document


def index(request):
    return HttpResponse("hi")


@csrf_exempt
def register(request):
    #return HttpResponse(x)

    login = request.META["HTTP_LOGIN"]
    password = request.META["HTTP_PASSWORD"]
    prms_json = request.body.decode("utf8")
    user = authenticate(username=login, password=password)
    if user is not None and user.has_perm("two_side_app.add_document"):
        prms = json.loads(prms_json)
        doc = Document(author=user, status=Document.Status.ACCEPTED, prms=prms_json)
        doc.save()
        prms['main']['id'] = doc.id
        return HttpResponse(json.dumps(prms))
    else:
        raise PermissionDenied

@csrf_exempt
def auth(request):
    login = request.META["HTTP_LOGIN"]
    password = request.META["HTTP_PASSWORD"]
    user = authenticate(username=login, password=password)
    if user is not None and user.has_perm("two_side_app.add_document"):
        return HttpResponse("ok")
    else:
        raise PermissionDenied




x='''
{
  "владелец" : {
    "адрес регистрации_Страна" : "Россия ",
    "адрес регистрации_Субъект Российской Федерации" : "01.Адыгея",
    "адрес регистрации_Район" : "Бедро",
    "адрес регистрации_Населенный пункт(при регистрации в России)" : "Махачкала",
    "адрес регистрации_Улица(при регистрации в России)" : "Калинина",
    "адрес регистрации_Дом" : "41",
    "адрес регистрации_Корпус" : "2",
    "адрес регистрации_Строение" : "3",
    "адрес регистрации_Квартира" : "44",
    "адрес регистрации_Почтовый индекс" : "123123123",
    "Фамилия" : "йцу",
    "Транслитерация фамилии" : "qwe",
    "Имя" : "фыв",
    "Транслитерация имени" : "asd",
    "Отчество" : "ячс",
    "Дата рождения" : "03.01.2017",
    "Пол" : "Мужской",
    "Регион места рождения" : "1.Адыгея",
    "Место рождения" : "Махачкала",
    "ИНН" : "1111111111111",
    "Индивидуальный предприниматель" : "Да",
    "Гражданство" : "Россия ",
    "Тип документа удостоверяющий личность" : "Пасспорт (Россия)",
    "Серия и номер документа, удостоверяющего личность" : "123123123",
    "Дата выдачи документа, удостоверяющего личность" : "02.01.2017",
    "Код подразделения" : "123123",
    "Кем выдан документ, удостоверяющий личность" : "Кировским РОВД",
    "Страна документа, удостоверяющего личность" : "Россия ",
    "Место работы" : "Калыма",
    "Должность" : "Начальник",
    "Домашний телефон" : "62222222",
    "Мобильный телефон" : "+7111111111",
    "Электронная почта" : "qwe@qwe.qwe"
  },
  "свид. о регистрации" : {
    "Серия и номер" : "qqq",
    "Тип" : "www",
    "Дата выдачи" : "02.01.2017",
    "Кем выдан" : "eee",
    "Особые отметки" : "rrr"
  },
  "представитель" : { },
  "ПТС" : {
    "Серия и номер" : "111",
    "Тип" : "222",
    "Дата выдачи" : "01.01.2017",
    "Кем выдан" : "333",
    "Особые отметки" : "444"
  },
  "main" : {
    "id" : "123",
    "date" : "21.01.2017",
    "Номер" : "Q123WE05",
    "VIN идентификационный номер1" : "1111111111111",
    "Марка" : "BMV",
    "Модель" : "5C",
    "Модификация" : "1",
    "Изготовитель" : "Германия",
    "Категория" : " A1",
    "Год выпуска" : "2010",
    "Модель двигателя" : "дддддд",
    "Номер двигателя" : "нннннн",
    "Номер кузова" : "кекккккккк",
    "Номер шасси" : "шшшшшшш",
    "Цвет" : "черненький",
    "Мощн. двигателя" : "1111",
    "Мощн. двигателя(квт)" : "2222",
    "Объем двигателя" : "3333",
    "Разрешается макс. масса(КГ)" : "4444",
    "Масса без нагрузки(КГ)" : "5555",
    "Ограниченный срок" : "false",
    "Статус" : "null",
    "Технологическая операция" : "Лизинг - Внесение изменений в регистрационные данные без изменения конструкции"
  }

}
'''