import json

from django.contrib.auth import authenticate
from django.core.exceptions import PermissionDenied
from django.http import HttpResponse
from django.views.decorators.csrf import csrf_exempt

from two_side_app.models import Document


def index(request):
    return HttpResponse("hi")


@csrf_exempt
def register(request):
    #return HttpResponse(x)

    login = request.META["HTTP_LOGIN"]
    password = request.META["HTTP_PASSWORD"]
    prms_json = request.body.decode("utf8")
    user = authenticate(username=login, password=password)
    if user is not None and user.has_perm("two_side_app.add_document"):
        prms = json.loads(prms_json)
        doc = Document(author=user, status=Document.Status.ACCEPTED, prms=prms_json)
        doc.save()
        prms['main']['id'] = doc.id
        return HttpResponse(json.dumps(prms))
    else:
        raise PermissionDenied

@csrf_exempt
def auth(request):
    login = request.META["HTTP_LOGIN"]
    password = request.META["HTTP_PASSWORD"]
    user = authenticate(username=login, password=password)
    if user is not None and user.has_perm("two_side_app.add_document"):
        return HttpResponse("ok")
    else:
        raise PermissionDenied




x='''
{
  "Свид. о регистрации" : {
    "Серия и номер" : "123123",
    "Тип" : "Технический паспорт транспортного средства индивидуального владельца",
    "Дата выдачи" : "02.02.2002",
    "Кем выдан" : "123123",
    "Особые отметки" : "123123"
  },
  "Владелец" : {
    "Адрес регистрации_Страна" : "Россия ",
    "Адрес регистрации_Субъект Российской Федерации" : "01.Адыгея",
    "Адрес регистрации_Район" : "Дыра",
    "Адрес регистрации_Населенный пункт(при регистрации в России)" : "Чанда",
    "Адрес регистрации_Улица(при регистрации в России)" : "Калинина",
    "Адрес регистрации_Дом" : "42",
    "Адрес регистрации_Корпус" : "1",
    "Адрес регистрации_Строение" : "2",
    "Адрес регистрации_Квартира" : "42",
    "Адрес регистрации_Почтовый индекс" : "123123123",
    "Адрес регистрации_ОКТМО" : "123123",
    "Фамилия" : "йцу",
    "Транслитерация фамилии" : "qwe",
    "Имя" : "фыв",
    "Транслитерация имени" : "asd",
    "Отчество" : "ячс",
    "Дата рождения" : "01.01.2001",
    "Пол" : "Мужской",
    "Регион места рождения" : "5.Дагестан",
    "Место рождения" : "Калыма",
    "ИНН" : "12312312",
    "Кем выдан ИНН" : "Морготом",
    "Индивидуальный предприниматель" : "Да",
    "ОГРНИП" : "123123",
    "Кем выдан ОГРНИП" : "123123123",
    "Гражданство" : "Россия ",
    "Тип документа удостоверяющий личность" : "Пасспорт",
    "Серия и номер документа, удостоверяющего личность" : "123123123",
    "Дата выдачи документа, удостоверяющего личность" : "02.02.2001",
    "Код подразделения" : "1231123",
    "Кем выдан документ, удостоверяющий личность" : "Кировским РОВД",
    "Страна документа, удостоверяющего личность" : "Россия ",
    "Место работы" : "Халтура",
    "Должность" : "Халтурщик"
  },
  "Представитель" : {
    "Фамилия" : "qwe",
    "Имя" : "asd",
    "Отчество" : "zxc"
  },
  "ПТС" : {
    "Серия и номер" : "123123123",
    "Тип" : "Паспорт транспортного средства",
    "Дата выдачи" : "02.02.2002",
    "Кем выдан" : "123123",
    "Особые отметки" : "1123123"
  },
  "Квитанция_об_оплате" : {
    "Сумма платежа" : "1000",
    "дата платежа" : "11.11.2011",
    "номер платежа" : "123123"
  },
  "main" : {
    "id" : "99999",
    "date" : "17.02.2017",
    "Номер" : "123123",
    "Тип" : "Автомобиль легковой.грузовой и автобусы (белый)",
    "VIN идентификационный номер1" : "123123123",
    "Марка" : "BMW",
    "Модель" : "mc2",
    "Модификация" : "32",
    "Изготовитель" : "Германия",
    "Тип ТС" : "Грузовой бортовой",
    "Категория" : " A",
    "Перевозка крупногабаритного груза" : "true",
    "Оборудование системы ГЛОНАСС" : "true",
    "Год выпуска" : "2010",
    "Модель двигателя" : "123123",
    "Номер двигателя" : "123123",
    "Номер кузова" : "123123",
    "Номер шасси" : "123123",
    "Цвет" : "Чернушный",
    "Цветовая группа" : "Белый",
    "Мощн. двигателя" : "233",
    "Мощн. двигателя(квт)" : "123",
    "Объем двигателя" : "100",
    "Разрешается макс. масса(КГ)" : "1230",
    "Масса без нагрузки(КГ)" : "1230",
    "Расположение руля" : "Правостороннее",
    "Технологическая операция" : "Регистрация нового ТС, изготовленного в РФ",
    "Ограниченный срок" : "true",
    "Свид. утрачено" : "false",
    "Страховой полис_Серия и номер" : "123123123",
    "Страховой полис_Дата выдачи" : "20.08.2021",
    "Страховой полис_Срок действия" : "20.08.2021",
    "Страховой полис_Страховщик" : "Кулер",
    "Серия и номер" : "123123",
    "Стоимость ТС" : "123123",
    "Свидетельство на агрегат" : "фвыфыв",
    "Прочие документы" : "ячсячс",
    "Статус" : "Уплачен",
    "Значение" : "1111111111"
  }
}
'''